RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_tdm.h
/***************************************************************************//**
* \file cy_tdm.h
* \version 1.0
*
* \brief
* The header file of the Audio TDM driver.
*
********************************************************************************
* \copyright
* Copyright 2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_tdm
* \{
* \note IP Supported: TDM
* \note Device Categories: CAT1B. Please refer <a href="usergroup1.html">Device Catalog</a>.
* Configures audio TDM/I2S.
*
* The functions and other declarations used in this driver are in cy_tdm.h.
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions
* and declarations in the PDL.
*
*
* Features:
* * Supports I2S mode and TDM mode.
* * Master and slave functionality.
* * Full-duplex transmitter and receiver operation.
* * Support for up to 32 channels.
* * Programmable channel size (up to 32 bits)
* * Programmable channel delay of 0 or 1 bit.
* * Delayed sampling support.
* * Programmable PCM sample formatting (8, 10, 12, 14, 16, 18, 20, 24, 32 bits).
* * Programmable synchronization pulse type.
* * Left-aligned and right-aligned sample formatting.
* * 128 entry TX FIFO with interrupt and trigger support.
* * 128 entry RX FIFO with interrupt and trigger support.
*
* \section group_tdm_configuration Configuration Considerations
*
* To set up a TDM driver, initialize the TDM Transmitter module in accordance with a configuration structure.
*
* * Each TDM/I2S (TX, RX) pair consists of a TDM/I2S transmitter and a TDM/I2S receiver.
* * The transmitter and receiver can function simultaneously and have dedicated clock control.
* * The transmitter and receiver have dedicated MMIO registers and a dedicated FIFO.
* * The transmitter and receiver have a dedicated FIFO interrupt and FIFO trigger.
* * The transmitter trigger is activated when a programmable number of PCM data slots is available in the TX FIFO.
* * The receiver trigger is activated when a programmable number of PCM data words is received into the RX FIFO.
*
*
* To set up TDM, provide the configuration parameters in the
* \ref cy_stc_tdm_config_t structure.
*
* For example, for Tx configuration, set txEnabled to true, configure
* txDmaTrigger (depending on whether DMA is going to be used or not), set
* extClk (if an external clock is used), provide clkDiv, masterMode,
* sckPolarity, fsyncPolarity, channelSize, wordSize,
* either i2sMode or TDM (based on Mode setting),
* fifoTriggerLevel (when the Trig interrupt will be used) and format
* A similar setup is for the Rx configuration.
*
* To initialize the TDM block, call the \ref Cy_AudioTDM_Init function, providing the
* filled \ref cy_stc_tdm_config_t structure.
* Before starting the transmission, enable the Tx \ref Cy_AudioTDM_EnableTx, then
* fill the first Tx data frame by calling \ref Cy_AudioTDM_WriteTxData. Then
* call the \ref Cy_AudioTDM_ActivateTx.
* For the reception the sequence is the same except for filling the first data
* frame.
*
* For example:
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_Init
*
* If you use a DMA, the DMA channel should be previously configured. The TDM interrupts
* (if applicable) can be enabled by calling \ref Cy_AudioTDM_SetTxInterruptMask.
*
* For example, if the trigger interrupt is used during operation, the ISR
* should call the \ref Cy_AudioTDM_WriteTxData as many times as required for your
* FIFO payload, but not more than the FIFO size. Then call \ref Cy_AudioTDM_ClearTxInterrupt
* with appropriate parameters.
*
* If a DMA is used and the DMA channel is properly configured - no CPU activity
* (or any application code) is needed for I2S/TDM operation.
*
* The I2S frame appears as:
* \image html i2s_frame.png
* This is an example for the channel length = 32. A similar case exists for the rest
* channel length configuration, with one limitation: the word length should be less than or equal
* to the channel length. See the datasheet of your device for more details.
*
* \section group_tdm_MISRA MISRA-C Compliance
* The TDM driver has the following specific deviations:
*
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>10.3</td>
*     <td>R</td>
*     <td>A composite expression of the "essentially unsigned" type is being
*         cast to a different type category.</td>
*     <td>The value got from the bitfield physically cannot exceed the enumeration
*         that describes this bitfield. So, the code is safe by design.</td>
*   </tr>
*   <tr>
*     <td>11.4</td>
*     <td>A</td>
*     <td>A cast should not be performed between a pointer to object type and
*         a different pointer to object type.</td>
*   </tr>
*   <tr>
*     <td>20.3</td>
*     <td>R</td>
*     <td>The validity of values passed to library functions shall be checked.</td>
*     <td>This violation is not caused by code changes, i.e. is not a regression.</td>
*   </tr>
* </table>
*
* \section group_tdm_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*

* \defgroup group_tdm_i2s_macros_intrerrupt_masks Interrupt Masks
* \defgroup group_tdm_data_structures Data Structures
* \defgroup group_tdm_enums Enumerated Types
* \defgroup group_tdm_macros Macros
* \defgroup group_tdm_functions Functions

*/

#if !defined (CY_TDM_H)
#define CY_TDM_H

