RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_tdm.h
    TDM_STRUCT_TX_INTR_TX(base) = interrupt;
    (void) TDM_STRUCT_TX_INTR_TX(base);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_SetTxInterrupt                               */
/***************************************************************************//**
*
* Set the Tx Interrupt
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupts to set.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_SetTxInterrupt
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_SetTxInterrupt( TDM_TX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_TX_MASK_VALID(interrupt));

    TDM_STRUCT_TX_INTR_TX_SET(base) = interrupt;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetTxInterruptMask                             */
/***************************************************************************//**
*
* Get TX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetTxInterruptMask
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_GetTxInterruptMask( TDM_TX_STRUCT_Type * base)
{
    return (TDM_STRUCT_TX_INTR_TX_MASK(base));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_SetTxInterruptMask                             */
/***************************************************************************//**
*
* Set TX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupt
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_SetTxInterruptMask
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_SetTxInterruptMask( TDM_TX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_TX_MASK_VALID(interrupt));

    TDM_STRUCT_TX_INTR_TX_MASK(base) = interrupt;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetTxInterruptStatusMasked                   */
/***************************************************************************//**
*
*  Reflects a bitwise AND between the INTR_TX and INTR_TX_MASK registers.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_GetTxInterruptStatusMasked( TDM_TX_STRUCT_Type * base)
{
    return (TDM_STRUCT_TX_INTR_TX_MASKED(base));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_SetTxTriggerInterruptMask                     */
/***************************************************************************//**
*
* Sets TX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_SetTxTriggerInterruptMask( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_INTR_TX_MASK(base) |= TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_MASK_FIFO_TRIGGER_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ClearTxTriggerInterruptMask                  */
/***************************************************************************//**
*
*  Clears TX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ClearTxTriggerInterruptMask( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_INTR_TX_MASK(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_MASK_FIFO_TRIGGER_Msk;
    TDM_STRUCT_TX_INTR_TX_MASK(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_MASK_FIFO_TRIGGER, 0U);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_ClearRxInterrupt                             */
/***************************************************************************//**
*
*  Clears RX interrupt
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupt
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_ClearRxInterrupt
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ClearRxInterrupt( TDM_RX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_RX_MASK_VALID(interrupt));

    TDM_STRUCT_RX_INTR_RX(base) = interrupt;
    (void) TDM_STRUCT_RX_INTR_RX(base);

}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_SetRxInterrupt                               */
/***************************************************************************//**
*
*  Sets RX interrupt
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupt
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_SetRxInterrupt
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_SetRxInterrupt( TDM_RX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_RX_MASK_VALID(interrupt));

    TDM_STRUCT_RX_INTR_RX_SET(base) = interrupt;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetRxInterruptMask                           */
/***************************************************************************//**
*
* Returns RX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetRxInterruptMask
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_GetRxInterruptMask( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_INTR_RX_MASK(base));
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_SetRxInterruptMask                             */
/***************************************************************************//**
*
* Sets RX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupt
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_SetRxInterruptMask
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_SetRxInterruptMask( TDM_RX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_RX_MASK_VALID(interrupt));

    TDM_STRUCT_RX_INTR_RX_MASK(base) = interrupt;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetRxInterruptStatusMasked                  */
/***************************************************************************//**
*
* Returns  a bitwise AND between the INTR_RX and INTR_RX_MASK registers
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The interrupt bit mask(s).
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_GetRxInterruptStatusMasked( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_INTR_RX_MASKED(base));
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_SetRxTriggerInterruptMask                   */
/***************************************************************************//**
*
* Sets Rx Interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_SetRxTriggerInterruptMask( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_INTR_RX_MASK(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_MASK_FIFO_TRIGGER_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ClearRxTriggerInterruptMask                  */
/***************************************************************************//**
*
* Clear RX interrupt Mask
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ClearRxTriggerInterruptMask( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_INTR_RX_MASK(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_MASK_FIFO_TRIGGER_Msk;
    TDM_STRUCT_RX_INTR_RX_MASK(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_MASK_FIFO_TRIGGER, 0U);
}

/** \} group_tdm_functions */


#if defined(__cplusplus)
}
#endif

#endif  /* (CY_TDM_H) */

/** \} group_tdm */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3');

#endif /* CY_IP_MXTDM */
/* [] END OF FILE */
